//------------------------------------------------------------------------------
//  1. Напишите программу, которая читает клавиатурный ввод до символа @ и повто­-
//    ряет его, за исключением десятичных цифр, преобразуя каждую букву верхнего 
//    регистра в букву нижнего регистра и наоборот. (Не забудьте о семействе функ­-
//    ций cctype.) 
//------------------------------------------------------------------------------


#include <iostream>
#include <cctype>

int main (int argc, char ** argv){
    char ch;
    while( (ch = std::cin.get()) != '@'){
        
        if (std::isalpha(int(ch))){
            if(isupper(static_cast<unsigned char>(ch))){
                ch = tolower(ch);
            } else {
                ch = toupper(ch);
            }
            std::cout << char(ch);
        }

    }
    return 0;
}