//	10. Напишите программу, использующую вложенные циклы, которая запрашивает 
//	у пользователя значение количества строк для отображения. Затем она должна 
//	отобразить указанное число строк со звездочками, с одной звездочкой в первой 
//	строке, двумя - во второй и т.д: В каждой строке звездочкам должны предше­
//	ствовать точки - в таком количестве, чтобы общее число символов в каждой 
//	строке было равно количеству строк. Пример запуска программы должен вы­
//	глядеть следующим образом: 
//	Введите количество строк : 5 
//		....*
//		...**
//		..***
//		.****
//		*****

